/*****************************************************************************
 * @file: status.h
 * @author: andy.zhang
 * @email: zhangt@sinux.com.cn
 * @version: v0.1
 */
#ifndef __STATUS_H
#define __STATUS_H
#include <pthread.h>
#ifdef __cplusplus
 extern "C" {
#endif
#include "../JSON/cJSON.h"
typedef struct wspy_gps{
	float longtitude;
	float latitude;
}WSPY_GPS;

extern WSPY_GPS wspy_gps;
//#include "../Mqtt/MQTTPacket.h"
/*****************************************************************************
 * Macro
 */

/*****************************************************************************
 * Type
 */
/*****************************************************************************
 * Declare
 */
extern char Last_Json[];
//extern bool StatusQueryEvtOn;
extern pthread_mutex_t gps_staus_mutex;
/*****************************************************************
* 函数描述：状态更新函数，用于更新指定操作的节点状态
* 参数：	  const char * operate 状态操作字串
* 		  const char * status  要更新的状态值
* 		  const char * parent_status 父节点状态
* 返回值：  int  			0 更新成功
* 						其他 更新失败
****************************************************************/
int update_status(const char * operate, const char * status, const char * parent_status);
// void remove_status(const char * operate);
/*****************************************************************
* 函数描述：gps 异常处理
* 参数： 无
* 返回值： 无
* ***************************************************************/
void gps_abort();
/*****************************************************************
* 函数描述：gps 状态上报函数，用于获取gps位置及组帧上报给mqtt服务器
* 参数： 无
* 返回值： 无
* ***************************************************************/
void gps_report(void);
/*****************************************************************
* 函数描述：wlan 故障上报函数
* 参数： 		char *wlan 网卡名称
* 			int ifup   是否down
* 			int mode   网卡模式
* 返回值： 无
****************************************************************/
void wlan_abort(char *wlan,int ifup,int mode);
/*****************************************************************
* 函数描述：状态上报函数，用于组帧上报设备状态
* 参数： 无
* 返回值： 无
* ***************************************************************/
void status_report();
/*****************************************************************
* 函数描述：打开红色led灯
* 参数： 无
* 返回值： 无
* ***************************************************************/
void red_led_on(void);
/*****************************************************************
* 函数描述：关闭红色led灯
* 参数： 无
* 返回值： 无
* ***************************************************************/
void red_led_off(void);
/*****************************************************************
* 函数描述：打开绿色led灯
* 参数： 无
* 返回值： 无
* ***************************************************************/
void green_led_on(void);
/*****************************************************************
* 函数描述：led绿灯关闭函数，控制关闭车载机箱led灯
* 参数： 		无
* 返回值： 	无
* ***************************************************************/
void green_led_off(void);
/*****************************************************************
* 函数描述：文件传输函数，用于传输握手包数据到mqtt服务器
* 参数： uint8_t *data	数据缓存指针
* 		uint32_t data_len 数据缓存长度
* 返回值： 无
* ***************************************************************/
void trans_file( uint8_t *data, uint32_t data_len);
/*****************************************************************
* 函数描述：程序状态初始化配置，通过读取程序初始化的状态文件和参数，恢复上次程序运行的状态
* 参数： 无
* 返回值： int 0 初始成功
* 		   其他  初始状态恢复失败
* ***************************************************************/
int init_status();
/*****************************************************************
* 函数描述：链表状态读取函数，用于读取状态值，并生成json数据
* 参数：	  cJSON * parent json 缓存指针
* 返回值：  无
****************************************************************/
void traverse_status_list(cJSON * parent);
/*****************************************************************
* 函数描述：打开绿色led灯
* 参数： 无
* 返回值： 无
* ***************************************************************/
void yellow_led_on(void);
#ifdef __cplusplus
 }
#endif

#endif //__STATUS_H
